---
kind: property
id: P:Autodesk.Revit.DB.FamilyParameter.GUID
source: html/5af1a48b-6353-0878-9d34-5b49ecfecb83.htm
---
# Autodesk.Revit.DB.FamilyParameter.GUID Property

The globally unique identifier

## Syntax (C#)
```csharp
public Guid GUID { get; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown when the parameter is not a shared parameter.